<template>
    <div class="page">
        <div class="flex">
            <div v-if="img[0]" class="image">
                <app-image :src="img[0]" styled="true"/>
            </div>
            <div class="headline">Звернення особливих дітей до тих, хто поруч</div>
        </div>

        <div class="text">
            <p>
                В один прекрасний день я з’явився на світ, ставши найбільшою радістю і невимовним болем моїх батьків. Бо
                я – ОСОБЛИВИЙ. Я так хочу знайти своє місце у житті. А для цього мені потрібна підтримка людей, що
                живуть поруч.
            </p>
            <p>
                Перш за все прошу вас подарувати мені справжнє дитинство, яке неможливе без друзів. Я ж маю на це право?
                Мої однолітки веселою юрбою ходять до школи, граються на перервах, читають книжки, яких я, можливо,
                ніколи не прочитаю і не зрозумію. Але чия в цьому вина?
            </p>
            <p class="mb">
                Вони катаються на велосипедах, лижах та ковзанах, ходять один до одного в гості, їздять відпочивати у
                табори, бачать такі незвідані горизонти, які мені навіть не сняться.
            </p>
            <p>
                Я ж прошу так мало. Просто дайте мені бути серед вас і почуватися не таким самотнім у цьому жорстокому
                світі.
            </p>
            <p>
                СПРИЙМАЙТЕ мене таким, який я є. Бо я член суспільства з самого народження.
            </p>
            <p>
                НЕ ІГНОРУЙТЕ і не робіть вигляд, що мене взагалі не існує.
            </p>
            <p>
                НЕ НАСМІХАЙТЕСЯ, бо ніхто, крім моїх батьків, не знає, як боляче буває від колючих слів.
            </p>
            <p>
                НЕ НЕХТУЙТЕ моїми проблемами. Бо тільки з вашою допомогою я зможу їх вирішити.
            </p>
            <p>
                ДАЙТЕ мені можливість стати вашим другом. Ви зрозумієте, як я вмію дружити, ділитися бодай мріями,
                співпереживати і співчувати.
            </p>
            <p>
                ПОВАЖАЙТЕ мене, бо я маю на це право, адже я – ЛЮДИНА.
            </p>
            <p class="mb">
                ВІДКРИЙТЕ своє серце для мене і таких як я. Озирніться навколо і ви побачите, що нас не так мало навколо
                вас. Теплий погляд, посмішка, щире співчуття та рука, простягнута назустріч, зробить наш світ добрішим,
                світлішим, кращим.
            </p>
            <p>
                І тоді заспіває моя душа. Я так хочу, щоб ви почули цю пісню. В ній сплелися біль і радість, розпач і
                надія, сльози і сміх. Всі ці щирі емоції живуть у кожному з нас. Вони роблять людину чистішою, щирішою,
                добрішою. Я вірю, що разом з вами ми зможемо зробити цей світ хоч трішки щасливішим.
            </p>
            <p class="mb">
                Адже лише палке серце, небайдужа душа, ясні очі і міцні руки обертають землю. А я так хочу жити на
                квітучій, добрій і відкритій для ОСОБЛИВИХ дітей землі.
            </p>
            <div class="flex mb">
                <div v-if="img[1]" class="image">
                    <app-image :src="img[1]" styled="true"/>
                </div>
                <div v-if="img[2]" class="image">
                    <app-image :src="img[2]" styled="true"/>
                </div>
                <div v-if="img[3]" class="image">
                    <app-image :src="img[3]" styled="true"/>
                </div>
            </div>
        </div>


        <div class="headline">
            <p>Комунальна установа</p>
            <p>«Інклюзивно-ресурсний центр»</p>
            <p>Вітовської районної ради Миколаївської області</p>
            <div class="caption">(скорочено КУ ІРЦ)</div>
        </div>
        <div class="text">
            <p class="mb">
                відкрилась 05.07.2018 року з метою забезпечення права дітей з особливими освітніми потребами віком від 2
                до
                18 років на здобуття дошкільної та загальної середньої освіти, в тому числі у професійно-технічних
                навчальних закладах, шляхом проведення комплексної психолого-педагогічної оцінки розвитку дитини,
                надання
                психолого-педагогічної допомоги та забезпечення системного кваліфікованого супроводження (крім
                вихованців
                дошкільних навчальних закладів (ясел-садків) компенсуючого типу, учнів спеціальних загальноосвітніх шкіл
                (шкіл-інтернатів).
            </p>
            <p class="mb">
                <span class="headline small">АДРЕСА</span><br>
                57214, Миколаївська обл., Вітовський район,<br>
                село Мішково-Погорілове, вулиця Валі Котика, будинок 23,<br>
                vitovskyirz@gmail.com<br>
                0974313461<br>
                (перший поверх М.-Погорілівської ЗОШ І-ІІІст.)
            </p>
            <p class="mb">
                <span class="headline small">ГРАФІК РОБОТИ ФАХІВЦІВ КУ "Інклюзивно-ресурсного центру"</span><br>
                <span class="caption">
                    ПН 8:00-17:00<br>
                    ВТ 8:00- 17:00<br>
                    СР 8:00- 17:00<br>
                    ЧТ Виїзний день<br>
                    ПТ 8:00 - 16:00<br>
                    Перерва 12:00-13:00
                </span>
            </p>
        </div>

        <div class="text">
            <p>
                Діяльність фахівців направлена на проведення комплексної оцінки дітей з особливими освітніми потребами,
                визначення рівня сформованості пізнавальних процесів, емоційно-вольової сфери, мовленнєвого розвитку,
                навчальної діяльності.
            </p>
            <p class="mb">
                У центрі проводяться індивідуальні та групові корекційно-розвиткові заняття, надаються консультативні
                послуги батькам (одному з батьків) або законним представникам дітей з особливими освітніми потребами та
                педагогам закладів освіти Вітовського району, Воскресенської ОТГ, Шевченківської ОТГ.
            </p>
            <p>
                Первинний прийом батьків або законних представників дитини в КУ «Інклюзивно-ресурсний центр» проводить
                директор центру або уповноважені ним працівники, які визначають час та дату проведення комплексної
                оцінки та встановлюють наявність таких документів:
            </p>
            <ul class="mb">
                <li>
                    документів, що посвідчують особу батьків (одного з батьків) або законних представників;
                </li>
                <li>
                    свідоцтва про народження дитини;
                </li>
                <li>
                    індивідуальної програми реабілітації дитини з інвалідністю (у разі інвалідності);
                </li>
                <li>
                    форми первинної облікової документації №112/0 "Історія розвитку дитини" затвердженої МОЗ, у разі
                    потреби - довідки від психіатра;
                </li>
                <li>
                    заяви щодо проведення комплексної психолого-педагогічної оцінки розвитку дитини;
                </li>
                <li>
                    згоди батьків (одного з батьків) або законних представників на обробку персональних даних їх
                    неповнолітньої дитини;
                </li>
                <li>
                    «Карта стану здоров’я та розвитку дитини».
                </li>
            </ul>

            <p>
                У разі коли дитина з особливими освітніми потребами здобуває дошкільну або загальну середню освіту до
                заяви можуть додаватися:
            </p>
            <ul class="mb">
                <li>
                    психолого-педагогічна характеристика дитини із зазначенням динаміки та якості засвоєння знань під
                    час навчання, підготовлена відповідним педагогічним працівником та затверджена керівником закладу
                    освіти;
                </li>
                <li>
                    зошити з рідної мови, математики, результати навчальних досягнень (для дітей, які здобувають
                    загальну середню освіту), малюнки;
                </li>
                <li>
                    документи щодо додаткових обстежень дитини.
                </li>
            </ul>

            <p>
                У разі коли дитині з особливими освітніми потребами вже надавались психолого-педагогічні та
                корекційно-розвиткові послуги до центру подаються:
            </p>
            <ul class="mb">
                <li>
                    попередні рекомендації щодо проведення комплексної оцінки;
                </li>
                <li>
                    висновок відповідних фахівців щодо результатів надання психолого-педагогічних та
                    корекційно-розвиткових послуг із зазначенням динаміки розвитку дитини згідно з індивідуальною
                    програмою розвитку.
                </li>
            </ul>
            <p>
                Участь батьків (одного з батьків) або законних представників дитини у проведенні комплексної оцінки є
                обов'язковою.
            </p>
        </div>

    </div>
</template>

<script>
    import fetchAndLoad from '../../mixins/fetchAndLoad';

    export default {
        name: "ircPage",
        mixins: [fetchAndLoad],
        data() {
            return {
                img: []
            }
        },
        created() {
            this.$fetch('ircImages')
                .then(img => Object.assign(this.$data, {img: img.map(i => i.src)}))
        }
    }
</script>

<style lang="scss" scoped>
    .mb {
        margin-bottom: 24px;
    }

    .image {
        max-width: 280px;
    }

    .flex {
        display: flex;
        flex-wrap: wrap;
        justify-content: center;
        align-items: center;

        .image {
            margin: 8px 24px 8px;
        }
    }

    .text {
        text-indent: 24px;
    }

    ul {
        margin-left: 36px;
        text-indent: 0;
    }
</style>
